src/cf/InformationRegisters/НастройкиЗарплатаКадры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиЗарплатаКадры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрименятьСевернуюНадбавку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьРайонныйКоэффициент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьСевернуюНадбавкуВПодразделениях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьРайонныйКоэффициентВПодразделениях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыплатыАвансаНеПозжеЧем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыплатыЗарплатыНеПозжеЧем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыплачиватьЗарплатуВПоследнийДеньМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/РасчетЗарплатыДляНебольшихОрганизацийПовтИсп/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает производственный календарь организации по умолчанию.
// Если производственный календарь организации не назначался - возвращается
// производственный календарь РФ.
//
// Параметры:
//	Организация	- СправочникСсылка.Организации
//
// ВозвращаемоеЗначение:
//	СправочникСсылка.ПроизводственныеКалендари
//
Функция ПроизводственныйКалендарьОрганизации(Организация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПроизводственныйКалендарь = Неопределено;
	
	Календарь = КалендарьОрганизации(Организация);
	Если ЗначениеЗаполнено(Календарь) Тогда
		
		Если ТипЗнч(Календарь) = Тип("СправочникСсылка.ПроизводственныеКалендари") Тогда
			ПроизводственныйКалендарь = Календарь;
		Иначе
			ПроизводственныйКалендарь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Календарь, "ПроизводственныйКалендарь");
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПроизводственныйКалендарь) Тогда
		ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ПроизводственныйКалендарь;
	
КонецФункции

Функция КалендарьОрганизации(Организация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Календари.Ссылка КАК Календарь
		|ИЗ
		|	Справочник.Календари КАК Календари
		|ГДЕ
		|	Календари.ВладелецГрафика = &Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Календарь) Тогда
		Календарь = Выборка.Календарь;
	Иначе
		Календарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Календарь;
	
КонецФункции

Функция ДатыВыплатыОрганизации(Организация, МесяцНачисления) Экспорт
	
	ДатыВыплаты = Новый Структура("Аванс,Зарплата");
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Запись = РегистрыСведений.НастройкиЗарплатаКадры.СоздатьМенеджерЗаписи();
		Запись.Организация = Организация;
		Запись.Прочитать();
		Если Не Запись.Выбран() Тогда
			Запись.Заполнить(Неопределено);
		Иначе
			Если Запись.ДатаВыплатыАвансаНеПозжеЧем = 0 Тогда
				Запись.ДатаВыплатыАвансаНеПозжеЧем = 20;
			КонецЕсли;
			Если Запись.ДатаВыплатыЗарплатыНеПозжеЧем = 0 Тогда
				Запись.ДатаВыплатыЗарплатыНеПозжеЧем = 5;
			КонецЕсли;
		КонецЕсли;
		
		ДатыВыплаты.Аванс = НачалоМесяца(МесяцНачисления)
			+ (Запись.ДатаВыплатыАвансаНеПозжеЧем - 1) * ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах();
		Если Запись.ВыплачиватьЗарплатуВПоследнийДеньМесяца Тогда
			ДатыВыплаты.Зарплата = НачалоДня(КонецМесяца(МесяцНачисления));
		Иначе
			ДатыВыплаты.Зарплата = КонецМесяца(МесяцНачисления) + 1
				+ (Запись.ДатаВыплатыЗарплатыНеПозжеЧем - 1) * ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах();
		КонецЕсли;
	Иначе
		ДатыВыплаты.Аванс = НачалоМесяца(МесяцНачисления) + 19 * ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах();
		ДатыВыплаты.Зарплата = НачалоДня(КонецМесяца(МесяцНачисления));
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыДляНебольшихОрганизаций.РасчетЗарплаты") Тогда
		МодульРасчетЗарплатыДляНебольшихОрганизаций = ОбщегоНазначения.ОбщийМодуль("РасчетЗарплатыДляНебольшихОрганизаций");
		ДатыВыплаты.Аванс = МодульРасчетЗарплатыДляНебольшихОрганизаций.ДатаСобытияСУчетомНерабочихДней(
				ДатыВыплаты.Аванс, Организация, Истина);
		ДатыВыплаты.Зарплата = МодульРасчетЗарплатыДляНебольшихОрганизаций.ДатаСобытияСУчетомНерабочихДней(
				ДатыВыплаты.Зарплата, Организация, Истина);
	КонецЕсли;
	
	Возврат ДатыВыплаты;
	
КонецФункции

Функция ДатаРасчетаАванса(МесяцНачисления) Экспорт
	
	// Ввиду отсутствия учета отработанного времени,
	// считаем, что аванс выплачивается за первую половину месяца.
	// Первая половина месяца определяется как дата середины месяц.
	
	ПоследнийДеньМесяца = День(КонецМесяца(МесяцНачисления));
	СерединаМесяца = Цел(ПоследнийДеньМесяца/2);
	ДатаРасчета = Дата(Год(МесяцНачисления), Месяц(МесяцНачисления), СерединаМесяца);
	
	Возврат ДатаРасчета;
	
КонецФункции

#КонецОбласти
